f32c/arduino/hardware/fpga/f32c/tools/boards-manager/boards.txt
#
# Xilinx Scarab Hardware miniSpartan6+ Board, f32c SoC
#
fpga_scarab_bram.name=Scarab miniSpartan6+ (Xilinx Spartan-6 XC6SLX25, 64K BRAM, 81.25/112.5 MHz)
fpga_scarab_bram.build.mcu=f32c
fpga_scarab_bram.build.core=f32c
fpga_scarab_bram.build.board=F32C_FPGA_SCARAB_BRAM
fpga_scarab_bram.upload.tool=ujprog
fpga_scarab_bram.upload.wait_for_upload_port=false
fpga_scarab_bram.upload.native_usb=false
fpga_scarab_bram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/scarab_ms6p.cfg
fpga_scarab_bram.bootloader.file.svf={runtime.tools.bootloaders.path}/scarab/scarab_{memsupport}_xc6slx25_{cpu.arch}_{bitstream.fcpu.mhz}mhz.svf
fpga_scarab_bram.bootloader.file.bit={runtime.tools.bootloaders.path}/scarab/scarab_{memsupport}_xc6slx25_{cpu.arch}_{bitstream.fcpu.mhz}mhz.bit
fpga_scarab_bram.bootloader.jtag_spi_bridge.bit={runtime.tools.bootloaders.path}/scarab/bscan_xc6s_ftg256_blink.bit
fpga_scarab_bram.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_scarab_bram.menu.cpu.mips=MIPS
fpga_scarab_bram.menu.cpu.mips.cpu.arch=mips
fpga_scarab_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_scarab_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_scarab_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_scarab_bram.menu.cpu.riscv=RISC-V
fpga_scarab_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_scarab_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_scarab_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_scarab_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_scarab_bram.menu.ramsize.64=64 KB BRAM Internal
fpga_scarab_bram.menu.ramsize.64.upload.maximum_size=64000
fpga_scarab_bram.menu.ramsize.64.build.extra_flags=--section-start=.init=0x400
# unified bitstream sdram = both bram and sdram
fpga_scarab_bram.menu.ramsize.64.memsupport=sdram
fpga_scarab_bram.menu.ramsize.32MB=32 MB SDRAM Onboard
fpga_scarab_bram.menu.ramsize.32MB.upload.maximum_size=33521664
fpga_scarab_bram.menu.ramsize.32MB.build.extra_flags=--section-start=.init=0x80000000
fpga_scarab_bram.menu.ramsize.32MB.memsupport=sdram
fpga_scarab_bram.menu.speed.83=83.33 MHz
fpga_scarab_bram.menu.speed.83.build.f_cpu=83333333
fpga_scarab_bram.menu.speed.83.bitstream.fcpu.mhz=83
fpga_scarab_bram.menu.speed.100=100 MHz
fpga_scarab_bram.menu.speed.100.build.f_cpu=100000000
fpga_scarab_bram.menu.speed.100.bitstream.fcpu.mhz=100
fpga_scarab_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_scarab_bram.menu.protocol.hex.upload.protocol=hex
fpga_scarab_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_scarab_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_scarab_bram.menu.protocol.bin.upload.protocol=bin
fpga_scarab_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_scarab_bram.menu.pinmap.generic=Generic
fpga_scarab_bram.menu.pinmap.generic.build.variant=generic
fpga_scarab_bram.menu.jtag.ft2232=Onboard FT2232 JTAG
fpga_scarab_bram.menu.jtag.ft2232.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/ft2232-generic.ocd
fpga_scarab_bram.menu.bitstream.sram_openocd=SRAM openocd (temporary)
fpga_scarab_bram.menu.bitstream.sram_openocd.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"
fpga_scarab_bram.menu.bitstream.sram_xc3sprog=SRAM xc3sprog (temporary)
fpga_scarab_bram.menu.bitstream.sram_xc3sprog.upload.bitstream.command={runtime.tools.xc3sprog.path}/xc3sprog -c ftdi_fast "{bootloader.file.bit}"
fpga_scarab_bram.menu.bitstream.flash_xc3sprog=FLASH xc3sprog (permanent)
fpga_scarab_bram.menu.bitstream.flash_xc3sprog.upload.bitstream.command={runtime.tools.xc3sprog.path}/xc3sprog -c ftdi_fast "-I{bootloader.jtag_spi_bridge.bit}" "{bootloader.file.bit}"

#
# Xilinx TB299 Board (ebay), f32c SoC
#
fpga_tb299.name=TB299 (Xilinx Spartan-6 XC6SLX9, 32K BRAM, 81.25/112.5 MHz)
fpga_tb299.build.mcu=f32c
fpga_tb299.build.core=f32c
fpga_tb299.build.board=F32C_FPGA_TB299
fpga_tb299.upload.tool=ujprog
fpga_tb299.upload.wait_for_upload_port=false
fpga_tb299.upload.native_usb=false
fpga_tb299.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"
fpga_tb299.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/tb299.cfg
fpga_tb299.bootloader.openocd.command=svf -tap chip.tap {{runtime.tools.bootloaders.path}/tb299/xc6slx9_{cpu.arch}_{bitstream.fcpu.mhz}mhz.svf}
fpga_tb299.menu.cpu.mips=MIPS
fpga_tb299.menu.cpu.mips.cpu.arch=mips
fpga_tb299.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_tb299.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_tb299.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_tb299.menu.cpu.riscv=RISC-V
fpga_tb299.menu.cpu.riscv.cpu.arch=riscv
fpga_tb299.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_tb299.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_tb299.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_tb299.menu.ramsize.32=32 KB BRAM Internal
fpga_tb299.menu.ramsize.32.upload.maximum_size=31232
fpga_tb299.menu.ramsize.32.build.extra_flags=--section-start=.init=0x400
fpga_tb299.menu.speed.81=81.25 MHz
fpga_tb299.menu.speed.81.build.f_cpu=81250000
fpga_tb299.menu.speed.81.bitstream.fcpu.mhz=81
fpga_tb299.menu.speed.112=112.5 MHz
fpga_tb299.menu.speed.112.build.f_cpu=112500000
fpga_tb299.menu.speed.112.bitstream.fcpu.mhz=112
fpga_tb299.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_tb299.menu.protocol.hex.upload.protocol=hex
fpga_tb299.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_tb299.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_tb299.menu.protocol.bin.upload.protocol=bin
fpga_tb299.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_tb299.menu.pinmap.generic=Generic
fpga_tb299.menu.pinmap.generic.build.variant=generic
fpga_tb299.menu.jtag.alterablaster=Altera Blaster
fpga_tb299.menu.jtag.alterablaster.bootloader.openocd.interface={runtime.tools.openocd.path}/scripts/interface/altera-usb-blaster.cfg
fpga_tb299.menu.jtag.remotebitbang=Remote bitbang (TCP jtag:3335)
fpga_tb299.menu.jtag.remotebitbang.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/remote_bitbang.cfg
fpga_tb299.menu.jtag.fpu1=PLDkit FPU1 JTAG
fpga_tb299.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg

#
# Altera TB276 Board (ebay), f32c SoC
#
fpga_tb276.name=TB276 (Altera Cyclone IV E EP4CE6, 16K BRAM, 81.25/112.5 MHz)
fpga_tb276.build.mcu=f32c
fpga_tb276.build.core=f32c
fpga_tb276.build.board=F32C_FPGA_TB276
fpga_tb276.upload.tool=ujprog
fpga_tb276.upload.wait_for_upload_port=false
fpga_tb276.upload.native_usb=false
fpga_tb276.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/tb276.cfg
fpga_tb276.bootloader.file.svf={runtime.tools.bootloaders.path}/tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.svf
fpga_tb276.bootloader.file.jic={runtime.tools.bootloaders.path}/tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.jic
fpga_tb276.bootloader.file.sof={runtime.tools.bootloaders.path}/tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.sof
fpga_tb276.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_tb276.menu.cpu.mips=MIPS
fpga_tb276.menu.cpu.mips.cpu.arch=mips
fpga_tb276.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_tb276.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_tb276.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_tb276.menu.cpu.riscv=RISC-V
fpga_tb276.menu.cpu.riscv.cpu.arch=riscv
fpga_tb276.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_tb276.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_tb276.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_tb276.menu.ramsize.16=16 KB BRAM Internal
fpga_tb276.menu.ramsize.16.upload.maximum_size=14848
fpga_tb276.menu.ramsize.16.build.extra_flags=--section-start=.init=0x400
fpga_tb276.menu.speed.81=81.25 MHz
fpga_tb276.menu.speed.81.build.f_cpu=81250000
fpga_tb276.menu.speed.81.bitstream.fcpu.mhz=81
fpga_tb276.menu.speed.112=112.5 MHz
fpga_tb276.menu.speed.112.build.f_cpu=112500000
fpga_tb276.menu.speed.112.bitstream.fcpu.mhz=112
fpga_tb276.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_tb276.menu.protocol.hex.upload.protocol=hex
fpga_tb276.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_tb276.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_tb276.menu.protocol.bin.upload.protocol=bin
fpga_tb276.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_tb276.menu.pinmap.generic=Generic
fpga_tb276.menu.pinmap.generic.build.variant=generic
fpga_tb276.menu.jtag.alterablaster=Altera Blaster
fpga_tb276.menu.jtag.alterablaster.bootloader.openocd.interface={runtime.tools.openocd.path}/scripts/interface/altera-usb-blaster.cfg
fpga_tb276.menu.jtag.remotebitbang=Remote bitbang (TCP jtag:3335)
fpga_tb276.menu.jtag.remotebitbang.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/remote_bitbang.cfg
fpga_tb276.menu.jtag.fpu1=FT2232 PLDkit FPU1
fpga_tb276.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg
fpga_tb276.menu.bitstream.sram=SRAM openocd (temporary)
fpga_tb276.menu.bitstream.sram.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"
fpga_tb276.menu.bitstream.sramquartus=SRAM quartus (temporary)
fpga_tb276.menu.bitstream.sramquartus.upload.bitstream.command="quartus_pgm" "--no_banner" "--mode=jtag" "-o" "P;{bootloader.file.sof}"
fpga_tb276.menu.bitstream.flashquartus=FLASH quartus (permanent)
fpga_tb276.menu.bitstream.flashquartus.upload.bitstream.command="quartus_pgm" "--no_banner" "--mode=jtag" "-o" "IPV;{bootloader.file.jic}"

#
# Xilinx Numato Mimas V2 Spartan-6
#
fpga_numato_mimasv2_bram.name=MimasV2 (Xilinx Spartan-6 XC6SLX9, 32K BRAM, 100 MHz)
fpga_numato_mimasv2_bram.build.mcu=f32c
fpga_numato_mimasv2_bram.build.core=f32c
fpga_numato_mimasv2_bram.build.board=F32C_FPGA_MIMASV2_BRAM
fpga_numato_mimasv2_bram.upload.tool=ujprog
fpga_numato_mimasv2_bram.upload.wait_for_upload_port=false
fpga_numato_mimasv2_bram.upload.native_usb=false
fpga_numato_mimasv2_bram.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"
fpga_numato_mimasv2_bram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/numato_mimasv2_bram.cfg
fpga_numato_mimasv2_bram.bootloader.openocd.command=svf -tap chip.tap {{runtime.tools.bootloaders.path}/numato_mimasv2/xc6slx9_{cpu.arch}_{bitstream.fcpu.mhz}mhz.svf}
fpga_numato_mimasv2_bram.menu.cpu.mips=MIPS
fpga_numato_mimasv2_bram.menu.cpu.mips.cpu.arch=mips
fpga_numato_mimasv2_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_numato_mimasv2_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_numato_mimasv2_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_numato_mimasv2_bram.menu.cpu.riscv=RISC-V
fpga_numato_mimasv2_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_numato_mimasv2_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_numato_mimasv2_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_numato_mimasv2_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_numato_mimasv2_bram.menu.ramsize.32=32 KB BRAM Internal
fpga_numato_mimasv2_bram.menu.ramsize.32.upload.maximum_size=31232
fpga_numato_mimasv2_bram.menu.ramsize.32.build.extra_flags=--section-start=.init=0x400
fpga_numato_mimasv2_bram.menu.speed.100=100 MHz
fpga_numato_mimasv2_bram.menu.speed.100.build.f_cpu=100000000
fpga_numato_mimasv2_bram.menu.speed.100.bitstream.fcpu.mhz=100
fpga_numato_mimasv2_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_numato_mimasv2_bram.menu.protocol.hex.upload.protocol=hex
fpga_numato_mimasv2_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_numato_mimasv2_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_numato_mimasv2_bram.menu.protocol.bin.upload.protocol=bin
fpga_numato_mimasv2_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_numato_mimasv2_bram.menu.pinmap.generic=Generic
fpga_numato_mimasv2_bram.menu.pinmap.generic.build.variant=generic
fpga_numato_mimasv2_bram.menu.jtag.alterablaster=Altera Blaster
fpga_numato_mimasv2_bram.menu.jtag.alterablaster.bootloader.openocd.interface={runtime.tools.openocd.path}/scripts/interface/altera-usb-blaster.cfg
fpga_numato_mimasv2_bram.menu.jtag.remotebitbang=Remote bitbang (TCP jtag:3335)
fpga_numato_mimasv2_bram.menu.jtag.remotebitbang.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/remote_bitbang.cfg
fpga_numato_mimasv2_bram.menu.jtag.fpu1=PLDkit FPU1 JTAG
fpga_numato_mimasv2_bram.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg

#
# Xilinx ESA11 Artix-7 board (Emanuel Stiebler)
#
fpga_esa11_7a35i_bram.name=ESA11 (Xilinx Artix-7 XC7A35I, 64K BRAM, 100 MHz)
fpga_esa11_7a35i_bram.build.mcu=f32c
fpga_esa11_7a35i_bram.build.core=f32c
fpga_esa11_7a35i_bram.build.board=F32C_FPGA_ESA11_7A35I_BRAM
fpga_esa11_7a35i_bram.upload.tool=ujprog
fpga_esa11_7a35i_bram.upload.wait_for_upload_port=false
fpga_esa11_7a35i_bram.upload.native_usb=false
fpga_esa11_7a35i_bram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/esa11_7a35i_ms6p.cfg
fpga_esa11_7a35i_bram.bootloader.file.bit={runtime.tools.bootloaders.path}/esa11/esa11_7a35i_{memsupport}_{cpu.arch}_hdmi_{bitstream.fcpu.mhz}mhz.bit
fpga_esa11_7a35i_bram.bootloader.jtag_spi_bridge.bit={runtime.tools.bootloaders.path}/esa11_7a35i/bscan_xc7a_fgg484_blink.bit
fpga_esa11_7a35i_bram.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_esa11_7a35i_bram.menu.cpu.mips=MIPS
fpga_esa11_7a35i_bram.menu.cpu.mips.cpu.arch=mips
fpga_esa11_7a35i_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_esa11_7a35i_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_esa11_7a35i_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_esa11_7a35i_bram.menu.cpu.riscv=RISC-V
fpga_esa11_7a35i_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_esa11_7a35i_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_esa11_7a35i_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_esa11_7a35i_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_esa11_7a35i_bram.menu.ramsize.64=64 KB BRAM Internal
fpga_esa11_7a35i_bram.menu.ramsize.64.upload.maximum_size=64000
fpga_esa11_7a35i_bram.menu.ramsize.64.build.extra_flags=--section-start=.init=0x400
fpga_esa11_7a35i_bram.menu.ramsize.64.memsupport=bram
fpga_esa11_7a35i_bram.menu.speed.100=100 MHz
fpga_esa11_7a35i_bram.menu.speed.100.build.f_cpu=100000000
fpga_esa11_7a35i_bram.menu.speed.100.bitstream.fcpu.mhz=100
fpga_esa11_7a35i_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_esa11_7a35i_bram.menu.protocol.hex.upload.protocol=hex
fpga_esa11_7a35i_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_esa11_7a35i_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_esa11_7a35i_bram.menu.protocol.bin.upload.protocol=bin
fpga_esa11_7a35i_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_esa11_7a35i_bram.menu.pinmap.generic=Generic
fpga_esa11_7a35i_bram.menu.pinmap.generic.build.variant=generic
fpga_esa11_7a35i_bram.menu.pinmap.esa11=ESA11
fpga_esa11_7a35i_bram.menu.pinmap.esa11.build.variant=esa11
fpga_esa11_7a35i_bram.menu.jtag.ft2232=Onboard FT4232 JTAG
fpga_esa11_7a35i_bram.menu.jtag.ft2232.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/ft4232-generic.ocd
fpga_esa11_7a35i_bram.menu.bitstream.sram_xc3sprog=SRAM xc3sprog (temporary)
fpga_esa11_7a35i_bram.menu.bitstream.sram_xc3sprog.upload.bitstream.command={runtime.tools.xc3sprog.path}/xc3sprog -c ft4232h_fast "{bootloader.file.bit}"

